#!/usr/bin/env python3
# -*- coding:utf-8 -*-

# このMODは、judge_kanjou.pyの返却データに依存しています

def plutchik(input_):
	plut = {'感情':'普通','心':{
			'安らぎ':0,
			'容認':0,
			'不安':0,
			'動揺':0,
			'感傷的':0,
			'倦怠': 0,
			'苛立ち':0,
			'関心':0
		}}
		
	for inp in input_:
	
		if inp in ['安らぎ','喜び','幸福感','穏やか','気持ちが良い']:
			# 安らぎ ++
			plut['心']['安らぎ'] += 2
			plut['心']['感傷的'] -= 2
		if inp in ['楽しさ', '感謝','祝う気持ち','好き','興奮']:
			# 安らぎ
			plut['心']['安らぎ'] += 1
			plut['心']['感傷的'] -= 1
		if inp in ['穏やか','誇らしい','尊敬・尊さ']:
			# 容認 ++
			plut['心']['容認'] += 2
			plut['心']['倦怠'] -= 2
		if inp in ['親しみ','祝う気持ち','好き']:
			# 容認
			plut['心']['容認'] += 1
			plut['心']['倦怠'] -= 1
		if inp in ['苦しさ','不安','恐怖','心配']:
			# 不安 ++
			plut['心']['不安'] += 2
			plut['心']['苛立ち'] -= 2
		if inp in ['焦り','恥ずかしい','きまずさ','あわれみ','ためらい','緊張']:
			# 不安
			plut['心']['不安'] += 1
			plut['心']['苛立ち'] -= 1
		if inp in ['驚き','恐れ（恐縮等の意味で）','失望']:
			# 動揺 ++
			plut['心']['動揺'] += 2
			plut['心']['関心'] -= 2
		if inp in ['あきれ','恥ずかしい','きまずさ','あわれみ','緊張','残念','困惑']:
			# 動揺
			plut['心']['動揺'] += 1
			plut['心']['関心'] -= 1
		if inp in ['寂しさ','悲しさ','失望','悩み','謝罪']:
			# 感傷的 ++
			plut['心']['感傷的'] += 2
			plut['心']['安らぎ'] -= 2	
		if inp in ['あきれ','切なさ','辛さ','残念','悔しさ','困惑','情けない']:
			# 感傷的
			plut['心']['感傷的'] += 1
			plut['心']['安らぎ'] -= 1	
		if inp in ['憎い','嫌悪','怠さ','悩み','謝罪']:
			# 倦怠 ++
			plut['心']['倦怠'] += 2
			plut['心']['容認'] -= 2		
		if inp in ['憂鬱','悔しさ','恨み','情けない']:
			# 倦怠
			plut['心']['倦怠'] += 1
			plut['心']['容認'] -= 1
		if inp in ['不満','怒り']:
			# 苛立ち ++
			plut['心']['苛立ち'] += 2
			plut['心']['不安'] -= 2	
		if inp in ['恨み','不快','妬み']:
			# 苛立ち
			plut['心']['苛立ち'] += 1
			plut['心']['不安'] -= 1
		if inp in ['願望','感動']:
			# 関心 ++
			plut['心']['関心'] += 2
			plut['心']['動揺'] -= 2	
		if inp in ['興奮','不快','妬み']:
			# 関心
			plut['心']['関心'] += 1
			plut['心']['動揺'] -= 1
	# ここから今の感情を読み取る処理を入れる
	# 時間経過で0へ近づく処理も
	return plut





		